RT-Thread/rt-thread/bsp/nxp/mcx/mcxa/Libraries/MCXA153/MCXA153/iar/startup_MCXA153.s
        PUBWEAK Reserved93_IRQHandler
        PUBWEAK Reserved93_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
Reserved93_IRQHandler
        LDR     R0, =Reserved93_DriverIRQHandler
        BX      R0

        PUBWEAK Reserved94_IRQHandler
        PUBWEAK Reserved94_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
Reserved94_IRQHandler
        LDR     R0, =Reserved94_DriverIRQHandler
        BX      R0

        PUBWEAK Reserved95_IRQHandler
        PUBWEAK Reserved95_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
Reserved95_IRQHandler
        LDR     R0, =Reserved95_DriverIRQHandler
        BX      R0

Reserved16_DriverIRQHandler
CMC_DriverIRQHandler
DMA_CH0_DriverIRQHandler
DMA_CH1_DriverIRQHandler
DMA_CH2_DriverIRQHandler
DMA_CH3_DriverIRQHandler
Reserved22_DriverIRQHandler
Reserved23_DriverIRQHandler
Reserved24_DriverIRQHandler
Reserved25_DriverIRQHandler
ERM0_SINGLE_BIT_DriverIRQHandler
ERM0_MULTI_BIT_DriverIRQHandler
FMU0_DriverIRQHandler
GLIKEY0_DriverIRQHandler
MBC0_DriverIRQHandler
SCG0_DriverIRQHandler
SPC0_DriverIRQHandler
Reserved33_DriverIRQHandler
WUU0_DriverIRQHandler
Reserved35_DriverIRQHandler
Reserved36_DriverIRQHandler
Reserved37_DriverIRQHandler
Reserved38_DriverIRQHandler
Reserved39_DriverIRQHandler
I3C0_DriverIRQHandler
Reserved41_DriverIRQHandler
LPI2C0_DriverIRQHandler
Reserved43_DriverIRQHandler
LPSPI0_DriverIRQHandler
LPSPI1_DriverIRQHandler
Reserved46_DriverIRQHandler
LPUART0_DriverIRQHandler
LPUART1_DriverIRQHandler
LPUART2_DriverIRQHandler
Reserved50_DriverIRQHandler
Reserved51_DriverIRQHandler
USB0_DriverIRQHandler
Reserved53_DriverIRQHandler
CDOG0_DriverIRQHandler
CTIMER0_DriverIRQHandler
CTIMER1_DriverIRQHandler
CTIMER2_DriverIRQHandler
Reserved58_DriverIRQHandler
Reserved59_DriverIRQHandler
FLEXPWM0_RELOAD_ERROR_DriverIRQHandler
FLEXPWM0_FAULT_DriverIRQHandler
FLEXPWM0_SUBMODULE0_DriverIRQHandler
FLEXPWM0_SUBMODULE1_DriverIRQHandler
FLEXPWM0_SUBMODULE2_DriverIRQHandler
Reserved65_DriverIRQHandler
QDC0_COMPARE_DriverIRQHandler
QDC0_HOME_DriverIRQHandler
QDC0_WATCHDOG_DriverIRQHandler
QDC0_INDEX_DriverIRQHandler
FREQME0_DriverIRQHandler
LPTMR0_DriverIRQHandler
Reserved72_DriverIRQHandler
OS_EVENT_DriverIRQHandler
WAKETIMER0_DriverIRQHandler
UTICK0_DriverIRQHandler
WWDT0_DriverIRQHandler
Reserved77_DriverIRQHandler
ADC0_DriverIRQHandler
Reserved79_DriverIRQHandler
CMP0_DriverIRQHandler
CMP1_DriverIRQHandler
Reserved82_DriverIRQHandler
Reserved83_DriverIRQHandler
Reserved84_DriverIRQHandler
Reserved85_DriverIRQHandler
Reserved86_DriverIRQHandler
GPIO0_DriverIRQHandler
GPIO1_DriverIRQHandler
GPIO2_DriverIRQHandler
GPIO3_DriverIRQHandler
Reserved91_DriverIRQHandler
Reserved92_DriverIRQHandler
Reserved93_DriverIRQHandler
Reserved94_DriverIRQHandler
Reserved95_DriverIRQHandler
DefaultISR
        B .

        END
